jp.go.nict.langrid.client.soap.test/bin/jp/go/nict/langrid/client/soap/io/SpeechTranslationService.req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
 xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <ns1:binding
       soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next"
       soapenv:mustUnderstand="0"
       xsi:type="soapenc:string"
       xmlns:ns1="http://langrid.nict.go.jp/process/binding/tree"
       xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      >[{&quot;children&quot;:[],&quot;gridId&quot;:null,&quot;invocationName&quot;:&quot;invocationame&quot;,&quot;serviceId&quot;:&quot;serviceId&quot;}]</ns1:binding>
   </soapenv:Header>
   <soapenv:Body>
      <ns2:translate
       soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
       xmlns:ns2="servicegrid:service:kyotou.langrid:SpeechTranslation">
         <sourceLang xsi:type="xsd:string">en</sourceLang>
         <targetLang xsi:type="xsd:string">ja</targetLang>
         <source href="#id0"/>
         <targetVoiceType xsi:type="xsd:string">voiceType</targetVoiceType>
         <targetAudioType xsi:type="xsd:string">AudioType</targetAudioType>
      </ns2:translate>
      <multiRef
       id="id0"
       soapenc:root="0"
       soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
       xsi:type="ns3:Speech"
       xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
       xmlns:ns3="http://langrid.nict.go.jp/ws_1_2/speech/">
         <audio xsi:type="xsd:base64Binary">aGVsbG8=</audio>
         <audioType xsi:type="xsd:string">audioType</audioType>
         <voiceType xsi:type="xsd:string">voiceType</voiceType>
      </multiRef>
   </soapenv:Body>
</soapenv:Envelope>
